cfg/DataProcessors/РабочийСтол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РабочийСтол</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfg/Catalogs/СотрудникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СотрудникиОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровСФизЛицами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаТарифнойСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостфиксНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйРазряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВзносов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыВзносовВФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДолжностьОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаНаРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДолжностьКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаНаРаботуВКомпанию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольненияИзКомпании</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоНаправлениюОргановЗанятости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГленкор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляВыплат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NameFamily</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NameSecond</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПерсональныеНадбавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Надбавка</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта6</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд6</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/DataProcessors/РабочийСтол/Forms/Форма/Ext/Form/Module.bsl
// Показывает веб-страницы в обработке Обозреватель  
//
// Параметры
//  АдресСтраницы  – Строка – адрес просматриваемой страницы
//  ЗаголовокОкна  – Строка – заголовок окна обработки
//
// Если передается пустая строка АдресСтраницы, то в обработке Обозреватель 
// просматривается веб-страница конфигурации
// 
Процедура ПоказатьВебСтраницу(АдресСтраницы, ЗаголовокОкна = Неопределено) Экспорт 
	
	Попытка
	
		Обозреватель = Обработки.Обозреватель.Создать();
		
		Форма = Обозреватель.ПолучитьФорму();
		Если ЗначениеЗаполнено(ЗаголовокОкна) Тогда
			Форма.Заголовок = ЗаголовокОкна;
		КонецЕсли;
		Форма.СтартоваяСтраница = АдресСтраницы;
		
		Форма.Открыть();
		
	Исключение
		
		ОбработкаИсключения(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ НАЖАТИЯ НА ЗНАЧКИ (ОБЩИЕ)


Процедура ОткрытьДокумент(Элемент)

	ОбработатьОткрытиеФормы(Элемент, Документы);
	
КонецПроцедуры // ОткрытьДокумент()

Процедура ОткрытьЖурналДокументов(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент, ЖурналыДокументов, Ложь);
	
КонецПроцедуры // ОткрытьЖурналДокументов()

Процедура ОткрытьОбработку(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент, Обработки, Ложь);
	
КонецПроцедуры // ОткрытьОбработку()

Процедура ОткрытьСправочник(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент, Справочники);
		
КонецПроцедуры // ОткрытьСправочник()

Процедура ОткрытьЗадачи(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент, Задачи);
	
КонецПроцедуры

Процедура ОткрытьРегистрСведений(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент, РегистрыСведений);
	
КонецПроцедуры // ОткрытьРегистрСведений()

Процедура ОткрытьПланВидовРасчета(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент, ПланыВидовРасчета);
	
КонецПроцедуры // ОткрытьПланВидовРасчета()

Процедура ОткрытьОтчет(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент, Отчеты, Ложь);
	
КонецПроцедуры // ОткрытьОтчет()

Процедура ОткрытьПланВидовХарактеристик(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент, ПланыВидовХарактеристик);
	
КонецПроцедуры // ОткрытьОтчет()

Процедура ОткрытьОбщуюФорму(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент);
	
КонецПроцедуры // ОткрытьОбщуюФорму()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ НАЖАТИЯ НА ЗНАЧКИ (СПЕЦИАЛЬНЫЕ)

Процедура ПисьмоВТехподдержку(Элемент)
	
	ФормаОбработкиПисьмоВТехподдержку(Элемент, ЭтаФорма);
	
КонецПроцедуры


Процедура ПоказатьСтраницуКонфигурации(Элемент)
	
	ФормаОбработкиПоказатьСтраницуКонфигурации(Элемент, ЭтаФорма);
	
КонецПроцедуры

Процедура НовыйСотрудник(Элемент)
	
	ВидДоговораСотрудника = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();

	// проверим какую форму надо использовать
	ИспользоватьПомощника = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ИспользоватьПомощникаПриемаНаРаботу");
	Если ИспользоватьПомощника Тогда
		Форма = Справочники.СотрудникиОрганизаций.ПолучитьФормуНовогоЭлемента("ФормаПомощник", Элемент);
	Иначе
		Форма = Справочники.СотрудникиОрганизаций.ПолучитьФормуНовогоЭлемента(, Элемент);
	КонецЕсли;
	
	Если Форма.Открыта() Тогда
		// просто активизируем уже открытую форму
		Форма.Активизировать();
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьПомощника Тогда
		Форма.СоздатьДокумент = Истина;
	КонецЕсли;
	
	Форма.Организация = ОсновнаяОрганизация;
	Форма.ВидДоговора = ВидДоговораСотрудника;
	Форма.Открыть();

КонецПроцедуры

Процедура ОткрытьТрудовыеДоговора(Элемент)
	Форма = Справочники.СотрудникиОрганизаций.ПолучитьФормуСписка("ФормаСпискаТрудовыхДоговоров");
	Форма.Открыть();
КонецПроцедуры

Процедура ФормаНастройкиПользователя(Элемент)
	ОткрытьФормуНастройкиПользователя();
КонецПроцедуры

Процедура ОсновнаяОрганизацияНажатие(Элемент)
	Если ОсновнаяОрганизация <> Справочники.Организации.ПустаяСсылка() Тогда
		ОсновнаяОрганизация.ПолучитьФорму().Открыть();
	КонецЕсли;
КонецПроцедуры

Процедура УправлениеРегламентированнойОтчетностью(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент, Обработки, Ложь, "УправлениеОтчетностью");

КонецПроцедуры



Процедура НовоеПисьмо(Элемент)
	
	УправлениеЭлектроннойПочтой.ОткрытьФормуНовогоПисьма();
	
КонецПроцедуры

Процедура ОткрытьФормуОстатковОтпусков(Элемент)
	
	ОбработатьОткрытиеФормы(Элемент, Обработки, Ложь);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ФОРМЫ

Процедура ЗакладкаНажатие(Элемент)
	
	ТекущийЭлемент = УстановитьЗакладку(Элемент.Имя, ЭлементыФормы);
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	ТекущийЭлемент = УстановитьЗакладку("Главная", ЭлементыФормы);
	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	УстановитьИмяТекущегоПользователя(ЭлементыФормы.ИмяПользователя.Заголовок);
	УстановитьОсновнуюОрганизацию(ЭлементыФормы.ОсновнаяОрганизация.Заголовок);
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьПользователя" И Параметр = ТекущийПользователь Тогда
		УстановитьИмяТекущегоПользователя(ЭлементыФормы.ИмяПользователя.Заголовок);
		// могли изменится параметры пользователя (основная организация или учетная запись)
		УстановитьОсновнуюОрганизацию(ЭлементыФормы.ОсновнаяОрганизация.Заголовок);
		УстановитьВидимостьНаписатьПисьмо();
		// или настройка режима рабочего стола
		ОбработатьЭлементыУправленияПоРежиму();
	ИначеЕсли ИмяСобытия = "ЗаписьОрганизации" И Параметр = ОсновнаяОрганизация Тогда
		УстановитьОсновнуюОрганизацию(ЭлементыФормы.ОсновнаяОрганизация.Заголовок);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработатьЭлементыУправленияПоРежиму()
	
	Управленческий = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ИспользоватьУправленческийРежимРабочегоСтола");
	
	ИмяАктивнойСтраницы = ?(Управленческий, "Упр", "Регл");
	ПанелиСоСменнымиСтраницами = Новый Массив;
	
	ПанелиСоСменнымиСтраницами.Добавить("ГлавнаяОтчеты");
	ПанелиСоСменнымиСтраницами.Добавить("ПанельНачисленияЗарплаты");
	ПанелиСоСменнымиСтраницами.Добавить("ПанельВыплатыЗарплаты");
	ПанелиСоСменнымиСтраницами.Добавить("РасчетЗарплатыОтчеты");
	ПанелиСоСменнымиСтраницами.Добавить("НачисленияУдержания");
	ПанелиСоСменнымиСтраницами.Добавить("ПанельКадровыеДокументы");
	ПанелиСоСменнымиСтраницами.Добавить("ПанельОтклонения");
	ПанелиСоСменнымиСтраницами.Добавить("КадровыйУчетОтчеты");
	ПанелиСоСменнымиСтраницами.Добавить("ПанельПодразделенияГлавная");
	ПанелиСоСменнымиСтраницами.Добавить("ПанельПодразделенияПерсонал");
	ПанелиСоСменнымиСтраницами.Добавить("ПанельУчетБухучетЗарплаты");
	ПанелиСоСменнымиСтраницами.Добавить("ПанельОсновнаяШтатноеРасписание");
	ПанелиСоСменнымиСтраницами.Добавить("ПанельОсновнаяОрганизация");
	ПанелиСоСменнымиСтраницами.Добавить("КадровыйУчетШтатноеРасписание");
	ПанелиСоСменнымиСтраницами.Добавить("РасчетЗарплатыОплатаНеявок");
	ПанелиСоСменнымиСтраницами.Добавить("РасчетЗарплатыСмотритеТакже");
	
	Для Каждого ПанельСоСменнымиСтраницами Из ПанелиСоСменнымиСтраницами Цикл
		ЭлементыФормы[ПанельСоСменнымиСтраницами].ТекущаяСтраница 		= ЭлементыФормы[ПанельСоСменнымиСтраницами].Страницы[ИмяАктивнойСтраницы];
	КонецЦикла;
	
КонецПроцедуры

          	
Процедура УстановитьВидимостьНаписатьПисьмо()
	УчетнаяЗаписьПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяУчетнаяЗапись");
	ЭлементыФормы.НовоеПисьмо.Видимость = ( УчетнаяЗаписьПоУмолчанию <> Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка());
КонецПроцедуры

Процедура ПриОткрытии()
	ОбработатьЭлементыУправленияПоРежиму();
	УстановитьВидимостьНаписатьПисьмо();
	
	Если Локализация.КодЯзыкаИнтерфейса() = "uk" Тогда
		Элементыформы.ГлавнаяАктивная.Картинка = БиблиотекаКартинок.ГлавнаяАктивнаяУкр;
		Элементыформы.Главная.Картинка = БиблиотекаКартинок.ГлавнаяНеАктивнаяУкр;
		Элементыформы.КадровыйУчетАктивная.Картинка = БиблиотекаКартинок.КадровыйУчетАктивнаяУкр;
		Элементыформы.КадровыйУчет.Картинка = БиблиотекаКартинок.КадровыйУчетНеАктивнаяУкр;
		Элементыформы.РасчетЗарплатыАктивная.Картинка = БиблиотекаКартинок.РасчетЗарплатыАктивнаяУкр;
		Элементыформы.РасчетЗарплаты.Картинка = БиблиотекаКартинок.РасчетЗарплатыНеАктивнаяУкр;
		Элементыформы.НалогиАктивная.Картинка = БиблиотекаКартинок.НалогиАктивнаяУкр;
		Элементыформы.Налоги.Картинка = БиблиотекаКартинок.НалогиНеАктивнаяУкр;
		Элементыформы.БухучетАктивная.Картинка = БиблиотекаКартинок.БухучетАктивнаяУкр;
		Элементыформы.Бухучет.Картинка = БиблиотекаКартинок.БухучетНеАктивнаяУкр;
		Элементыформы.ПерсоналАктивная.Картинка = БиблиотекаКартинок.ПерсоналАктивнаяУкр;
		Элементыформы.Персонал.Картинка = БиблиотекаКартинок.ПерсоналНеАктивнаяУкр;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПланСчетовНажатие(Элемент)
	
	ПланыСчетов.Хозрасчетный.ПолучитьФормуСписка().Открыть();
	
КонецПроцедуры
